FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_ssc.h
/* -------- SSC_IDR : (SSC Offset: 0x48) Interrupt Disable Register -------- */
#define SSC_IDR_TXRDY                  ( 0x1u << 0 )                       /**< \brief (SSC_IDR) Transmit Ready Interrupt Disable */
#define SSC_IDR_TXEMPTY                ( 0x1u << 1 )                       /**< \brief (SSC_IDR) Transmit Empty Interrupt Disable */
#define SSC_IDR_RXRDY                  ( 0x1u << 4 )                       /**< \brief (SSC_IDR) Receive Ready Interrupt Disable */
#define SSC_IDR_OVRUN                  ( 0x1u << 5 )                       /**< \brief (SSC_IDR) Receive Overrun Interrupt Disable */
#define SSC_IDR_CP0                    ( 0x1u << 8 )                       /**< \brief (SSC_IDR) Compare 0 Interrupt Disable */
#define SSC_IDR_CP1                    ( 0x1u << 9 )                       /**< \brief (SSC_IDR) Compare 1 Interrupt Disable */
#define SSC_IDR_TXSYN                  ( 0x1u << 10 )                      /**< \brief (SSC_IDR) Tx Sync Interrupt Enable */
#define SSC_IDR_RXSYN                  ( 0x1u << 11 )                      /**< \brief (SSC_IDR) Rx Sync Interrupt Enable */
/* -------- SSC_IMR : (SSC Offset: 0x4C) Interrupt Mask Register -------- */
#define SSC_IMR_TXRDY                  ( 0x1u << 0 )                       /**< \brief (SSC_IMR) Transmit Ready Interrupt Mask */
#define SSC_IMR_TXEMPTY                ( 0x1u << 1 )                       /**< \brief (SSC_IMR) Transmit Empty Interrupt Mask */
#define SSC_IMR_RXRDY                  ( 0x1u << 4 )                       /**< \brief (SSC_IMR) Receive Ready Interrupt Mask */
#define SSC_IMR_OVRUN                  ( 0x1u << 5 )                       /**< \brief (SSC_IMR) Receive Overrun Interrupt Mask */
#define SSC_IMR_CP0                    ( 0x1u << 8 )                       /**< \brief (SSC_IMR) Compare 0 Interrupt Mask */
#define SSC_IMR_CP1                    ( 0x1u << 9 )                       /**< \brief (SSC_IMR) Compare 1 Interrupt Mask */
#define SSC_IMR_TXSYN                  ( 0x1u << 10 )                      /**< \brief (SSC_IMR) Tx Sync Interrupt Mask */
#define SSC_IMR_RXSYN                  ( 0x1u << 11 )                      /**< \brief (SSC_IMR) Rx Sync Interrupt Mask */
/* -------- SSC_WPMR : (SSC Offset: 0xE4) Write Protection Mode Register -------- */
#define SSC_WPMR_WPEN                  ( 0x1u << 0 )                       /**< \brief (SSC_WPMR) Write Protection Enable */
#define SSC_WPMR_WPKEY_Pos             8
#define SSC_WPMR_WPKEY_Msk             ( 0xffffffu << SSC_WPMR_WPKEY_Pos ) /**< \brief (SSC_WPMR) Write Protection Key */
#define SSC_WPMR_WPKEY( value )    ( ( SSC_WPMR_WPKEY_Msk & ( ( value ) << SSC_WPMR_WPKEY_Pos ) ) )
#define   SSC_WPMR_WPKEY_PASSWD        ( 0x535343u << 8 )                  /**< \brief (SSC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. */
/* -------- SSC_WPSR : (SSC Offset: 0xE8) Write Protection Status Register -------- */
#define SSC_WPSR_WPVS                  ( 0x1u << 0 )                       /**< \brief (SSC_WPSR) Write Protection Violation Status */
#define SSC_WPSR_WPVSRC_Pos            8
#define SSC_WPSR_WPVSRC_Msk            ( 0xffffu << SSC_WPSR_WPVSRC_Pos )  /**< \brief (SSC_WPSR) Write Protect Violation Source */

/*@}*/


#endif /* _SAMV71_SSC_COMPONENT_ */
